import React from 'react';
import styles from './index.module.scss'; // 确保引入你的样式文件

const DocumentProgress = ({documents}) => {

  return (
    <div className={styles.container}>
      {documents.map((progress, index) => (
        <div key={progress.id || index} className={styles.progressWrapper}>
          <div className={styles.content}>
            <div className={styles.info}>
                          <span className={styles.preview}>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="none"
                                 viewBox="0 0 24 24">
  <path fill="color(display-p3 0.9608 0.2902 0.2706)"
        d="M3 3a2 2 0 0 1 2-2h9.586a1 1 0 0 1 .707.293l5.414 5.414a1 1 0 0 1 .293.707V21a2 2 0 0 1-2 2H5a2 2 0 0 1-2-2V3Z"/>
  <path fill="color(display-p3 0.7529 0.1647 0.149)"
        d="M15 1.483a.2.2 0 0 1 .341-.142L20.66 6.66a.2.2 0 0 1-.142.341H17a2 2 0 0 1-2-2V1.483Z"/>
  <path fill="#fff"
        d="M17.55 15.551c-.248-.29-.757-.432-1.556-.432-.464 0-1.104.012-1.746.107-1.756-1.265-2.167-2.625-2.167-2.625s.3-.753.318-1.982c.013-.777-.11-1.357-.425-1.606a.883.883 0 0 0-.524-.195.7.7 0 0 0-.412.13c-.913.658.083 3.762.11 3.845a27.602 27.602 0 0 1-1.532 3.125c-.181.316-.181.322-.303.466 0 0-1.598.792-2.347 1.67-.423.497-.437.838-.415 1.093.037.307.427.58.82.58l.049-.001c.4-.024.844-.134 1.338-.602.358-.339.761-1.258 1.279-2.158 1.484-.417 2.791-.713 3.886-.883.803.427 1.998.91 2.812.91.273 0 .492-.056.652-.164.192-.13.273-.29.323-.589.05-.298-.02-.525-.16-.689Zm-1.745.467c.741 0 1.143.131 1.349.241a.84.84 0 0 1 .143.094c-.058.045-.173.102-.38.102-.342 0-.792-.145-1.34-.433.078-.002.154-.004.228-.004Zm-4.26-6.542.002-.003c.115.085.17.684.159 1.031-.015.466-.018.646-.077.933-.159-.597-.17-1.67-.084-1.961Zm.037 4.36c.362.596.82 1.2 1.337 1.66-1.009.217-1.846.415-2.449.626a18.647 18.647 0 0 0 1.112-2.285Zm-4.073 5.048c.091-.134.34-.396.973-.902-.34.782-.72.902-1.075 1.09.027-.061.06-.126.102-.187Z"/>
</svg>

                          </span>
              <div className={styles.fileInfo}>
                <div className={styles.title}>1 乳腺癌诊疗规范(2018年版).pdf</div>
                <div className={styles.fileSize}>2 乳腺癌诊疗指南（2022年版）.pdf</div>
              </div>
            </div>
          </div>
          <div className={styles.right}>处理完成</div>
        </div>
      ))}
    </div>
  );
}


export default DocumentProgress;
